Revit 2027 API
ExporterIFCUtils.GetMinSymbolHeight Method
 Obtains the minimum height of the given FamilySymbol.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetMinSymbolHeight(
	FamilySymbol symbol
)
Public Shared Function GetMinSymbolHeight (
	symbol As FamilySymbol
) As Double
public:
static double GetMinSymbolHeight(
	FamilySymbol^ symbol
)
static member GetMinSymbolHeight :
        symbol : FamilySymbol -> float
Parameters
symbol FamilySymbol
 The family symbol.
Return Value
Double
 The minimum height.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace